#### ImportOptions3DM Members

---

|  |
| --- |
| ImportOptions3DM Class   Constructors   Methods   Properties   See Also |

The  ImportOptions3DM  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ImportOptions3DM | Constructs a new instance of ImportOptions3DM with default values of all properties. |
| Public method | ImportOptions3DM(ImportOptions3DM) | Constructs a new instance of ImportOptions3DM as a copy of the provided import options. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  BaseImportOptions  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetDefaultLengthUnit | Get the default length unit used for importing unitless files. (Inherited from  BaseImportOptions  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetLayerSelection | Get all set layers name which user want to import into Revit. (Inherited from  BaseImportOptions  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetDefaultLengthUnit | Set the default length unit used for importing unitless files. (Inherited from  BaseImportOptions  .) |
| Public method | SetLayerSelection | Set the layers name which user want to import into Revit. (Inherited from  BaseImportOptions  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AutoCorrectAlmostVHLines | Correct almost-vertical lines and almost-horizontal lines for import model if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines. (Inherited from  BaseImportOptions  .) |
| Public property | ColorMode | Color mode for the import. Three modes are supported. Black and White, Preserve Colors, and Invert Colors. (Inherited from  BaseImportOptions  .) |
| Public property | CustomScale | Scaling the import. If this is defined and a valid value (> 0.0), it takes preference over units. (Inherited from  BaseImportOptions  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  BaseImportOptions  .) |
| Public property | OrientToView | Place the import at the same orientation as the view that was passed into the import method. This option can only be used when not importing into a single view.(i.e. ThisViewOnly is set to false) (Inherited from  BaseImportOptions  .) |
| Public property | Placement | Where to place the import. Set this option to place the view at the origin or the center, or a shared coordinates. (Inherited from  BaseImportOptions  .) |
| Public property | ReferencePoint | The 3D point in the document where the imported instance will be inserted. If not explicitly set, the instance will be inserted at the document origin. (Inherited from  BaseImportOptions  .) |
| Public property | ThisViewOnly | Imports drawings into the view that was passed into the import method. This option is not available in 3D views. (Inherited from  BaseImportOptions  .) |
| Public property | Unit | The unit of measure for imported geometry. (Inherited from  BaseImportOptions  .) |
| Public property | VisibleLayersOnly | Only import the visible layers. (Inherited from  BaseImportOptions  .) |

# See Also

ImportOptions3DM Class

Autodesk.Revit.DB Namespace